programmingTutorial09-10/programmingTutorial09-10/testCase/004-icoChtMultiRegionFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoChtMultiRegionFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.01;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes; // no; // 

maxCo           0.9;

/*functions
{
    probes
    {
        type            probes;
        functionObjectLibs ( "libsampling.so" );
        enabled         true;
        outputControl   timeStep;
        outputInterval  1;
        region          solid;
        probeLocations
        (
            ( 0. -0.02 0. )
        );
        fields
        (
            T
        );
    }
    }*/

// ************************************************************************* //
