programmingTutorial09-10/programmingTutorial09-10/testCase/004-icoChtMultiRegionFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.5 -0.04  -0.01)
    ( 0.5 -0.04  -0.01)
    ( 0.5  0.04  -0.01)
    (-0.5  0.04  -0.01)
    (-0.5 -0.04   0.01)
    ( 0.5 -0.04   0.01)
    ( 0.5  0.04   0.01)
    (-0.5  0.04   0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (151 50 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
 patch minX
 (
  (0 4 7 3)
  )
 patch maxX
 (
  (2 6 5 1)
  )
 symmetryPlane minY
 (
  (1 5 4 0)
  )
 wall maxY
 (
  (3 7 6 2)
  )
 empty minZ
 (
  (0 3 2 1)
  )
 empty maxZ
 (
  (4 5 6 7)
  )
);

mergePatchPairs
(
);

// ************************************************************************* //
