programmingTutorial09-10/programmingTutorial09-10/testCase/004-icoChtMultiRegionFoam/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 1.01 0 0 );

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform ( 1.01 0 0 );
    }
    maxX
    {
        type            inletOutlet;
        value           uniform ( 1.01 0 0 );
        inletValue      uniform ( 0 0 0 );
    }
    minY
    {
        type            symmetryPlane;
    }
    minZ
    {
        type            empty;
    }
    maxZ
    {
        type            empty;
    }
    fluid_to_solid
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
