programmingTutorial09-10/programmingTutorial09-10/testCase/004-icoChtMultiRegionFoam/0/solid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0/solid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1 0 0);

boundaryField
{
    minX
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    maxX
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    maxY
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    minZ
    {
        type            empty;
    }
    maxZ
    {
        type            empty;
    }
    solid_to_fluid
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
