programmingTutorial09-10/programmingTutorial09-10/testCase/004-icoChtMultiRegionFoam/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/fluid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    minX
    {
        type            zeroGradient;
        value           uniform 0;
    }
    maxX
    {
        type            fixedValue;
        value           uniform 0;
    }
    minY
    {
        type            symmetryPlane;
    }
    minZ
    {
        type            empty;
    }
    maxZ
    {
        type            empty;
    }
    fluid_to_solid
    {
        type            zeroGradient;
        value           uniform 0;
    }
}


// ************************************************************************* //
