programmingTutorial09-10/programmingTutorial09-10/testCase/004-icoChtMultiRegionFoam/0/bkp/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    minX
      {
	type zeroGradient;
	value           uniform 0;
      }
    maxX
      {
	type zeroGradient;
	value           uniform 0;
      }
    minY
            {
                type            symmetryPlane;
            }
    maxY
      {
	type zeroGradient;
	value           uniform 0;
      }
    minZ
      {
	type empty;
      }
    maxZ
      {
	type empty;
      }
}

// ************************************************************************* //
