programmingTutorial09-10/programmingTutorial09-10/testCase/004-icoChtMultiRegionFoam/0/solid/cp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/solid";
    object      cp;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 -1 0 0 0 ];

internalField   uniform 880;

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform 880;
    }
    maxX
    {
        type            fixedValue;
        value           uniform 880;
    }
    maxY
    {
        type            fixedValue;
        value           uniform 880;
    }
    minZ
    {
        type            empty;
    }
    maxZ
    {
        type            empty;
    }
    solid_to_fluid
    {
        type            fixedValue;
        value           uniform 880;
    }
}


// ************************************************************************* //
