programmingTutorial09-10/programmingTutorial09-10/testCase/004-icoChtMultiRegionFoam/0/solid/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/solid";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -3 0 0 0 0 0 ];

internalField   uniform 2500;

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform 2500;
    }
    maxX
    {
        type            fixedValue;
        value           uniform 2500;
    }
    maxY
    {
        type            fixedValue;
        value           uniform 2500;
    }
    minZ
    {
        type            empty;
    }
    maxZ
    {
        type            empty;
    }
    solid_to_fluid
    {
        type            fixedValue;
        value           uniform 2500;
    }
}


// ************************************************************************* //
